app/views/messages/_main_chat.html.haml

SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 2
---
        Member:
        - @group.users.each do |user|