app/views/messages/_side_bar.html.haml

  .chat_side_groups
    - current_user.groups.each do |group|
      .group
---
SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 2