app/controllers/groups_controller.rb

  def edit
    @group = Group.find(params[:id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1

  def update
   if @group.update(group_params)
---
UPDATE `groups` SET `name` = 'abc', `updated_at` = '2020-05-11 09:28:13' WHERE `groups`.`id` = 1